uploads/xml/Travelport-Request-661a8c46b6b79-1338.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <air:LowFareSearchReq xmlns:air="http://www.travelport.com/schema/air_v51_0" xmlns:com="http://www.travelport.com/schema/common_v51_0" SolutionResult="false" TargetBranch="P3763969" TraceId="be46e60a786bbcabc98567e7cf358b54">
      <com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
      <air:SearchAirLeg>
        <air:SearchOrigin>
          <com:CityOrAirport Code="YUL"/>
        </air:SearchOrigin>
        <air:SearchDestination>
          <com:CityOrAirport Code="MIA"/>
        </air:SearchDestination>
        <air:SearchDepTime PreferredTime="2025-01-25">
          <com:SearchExtraDays DaysBefore="3" DaysAfter="3"/>
        </air:SearchDepTime>
        <air:AirLegModifiers>
          <air:PermittedCabins>
            <com:CabinClass Type="Economy"/>
          </air:PermittedCabins>
        </air:AirLegModifiers>
      </air:SearchAirLeg>
      <air:SearchAirLeg>
        <air:SearchOrigin>
          <com:CityOrAirport Code="MIA"/>
        </air:SearchOrigin>
        <air:SearchDestination>
          <com:CityOrAirport Code="YUL"/>
        </air:SearchDestination>
        <air:SearchDepTime PreferredTime="2025-02-02">
          <com:SearchExtraDays DaysBefore="3" DaysAfter="3"/>
        </air:SearchDepTime>
        <air:AirLegModifiers>
          <air:PermittedCabins>
            <com:CabinClass Type="Economy"/>
          </air:PermittedCabins>
        </air:AirLegModifiers>
      </air:SearchAirLeg>
      <air:AirSearchModifiers>
        <air:PreferredProviders>
          <com:Provider Code="1G"/>
        </air:PreferredProviders>
      </air:AirSearchModifiers>
      <com:SearchPassenger Code="ADT" Age="30"/>
      <com:SearchPassenger Code="ADT" Age="30"/>
      <com:SearchPassenger Code="ADT" Age="30"/>
      <com:SearchPassenger Code="ADT" Age="30"/>
      <com:SearchPassenger Code="ADT" Age="30"/>
      <com:SearchPassenger Code="ADT" Age="30"/>
      <air:AirPricingModifiers CurrencyType="SAR"/>
    </air:LowFareSearchReq>
  </soapenv:Body>
</soapenv:Envelope>
